Revit 2027 API
IExtension.HasMiter Property
Retrieves the miter status at the end
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
bool this[
	int index
] { get; }
ReadOnly Property HasMiter (
	index As Integer
) As Boolean
	Get
property bool HasMiter[int index] {
	bool get (int index);
}
abstract HasMiter : bool with get
Parameters
index Int32
Property Value
Boolean
Remarks
Property index must be 0 or 1 to indicate two ends, otherwise exceptions will be thrown. For beams, this can check whether the beam is mitered with other beams at the end
See Also
Reference
IExtension Interface
Autodesk.Revit.DB Namespace